# parameters
nc: 20  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 24
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 37
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50
  ]

# YOLOv7 head with CBAM integration
head:
  [[-1, 1, SPPCSPC, [512]], # 51

   [-1, 1, Conv, [256, 1, 1]], # 52
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 53
   [37, 1, Conv, [256, 1, 1]], # 54, route backbone P4
   [[-1, -2], 1, Concat, [1]], # 55

   [-1, 1, Conv, [256, 1, 1]], # 56
   [-2, 1, Conv, [256, 1, 1]], # 57
   [-1, 1, Conv, [128, 3, 1]], # 58
   [-1, 1, Conv, [128, 3, 1]], # 59
   [-1, 1, Conv, [128, 3, 1]], # 60
   [-1, 1, Conv, [128, 3, 1]], # 61
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]], # 62
   [-1, 1, Conv, [256, 1, 1]], # 63

   [-1, 1, CBAM, [256]], # 64, Adding CBAM here

   [-1, 1, Conv, [128, 1, 1]], # 65
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 66
   [24, 1, Conv, [128, 1, 1]], # 67, route backbone P3
   [[-1, -2], 1, Concat, [1]], # 68

   [-1, 1, Conv, [128, 1, 1]], # 69
   [-2, 1, Conv, [128, 1, 1]], # 70
   [-1, 1, Conv, [64, 3, 1]], # 71
   [-1, 1, Conv, [64, 3, 1]], # 72
   [-1, 1, Conv, [64, 3, 1]], # 73
   [-1, 1, Conv, [64, 3, 1]], # 74
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]], # 75
   [-1, 1, Conv, [128, 1, 1]], # 76

   [-1, 1, CBAM, [128]], # 77, Adding CBAM here

   [-1, 1, MP, []], # 78
   [-1, 1, Conv, [128, 1, 1]], # 79
   [-3, 1, Conv, [128, 1, 1]], # 80
   [-1, 1, Conv, [128, 3, 2]], # 81
   [[-1, -3, 64], 1, Concat, [1]], # 82

   [-1, 1, Conv, [256, 1, 1]], # 83
   [-2, 1, Conv, [256, 1, 1]], # 84
   [-1, 1, Conv, [128, 3, 1]], # 85
   [-1, 1, Conv, [128, 3, 1]], # 86
   [-1, 1, Conv, [128, 3, 1]], # 87
   [-1, 1, Conv, [128, 3, 1]], # 88
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]], # 89
   [-1, 1, Conv, [256, 1, 1]], # 90

   [-1, 1, CBAM, [256]], # 91, Adding CBAM here

   [-1, 1, MP, []], # 92
   [-1, 1, Conv, [256, 1, 1]], # 93
   [-3, 1, Conv, [256, 1, 1]], # 94
   [-1, 1, Conv, [256, 3, 2]], # 95
   [[-1, -3, 51], 1, Concat, [1]], # 96

   [-1, 1, Conv, [512, 1, 1]], # 97
   [-2, 1, Conv, [512, 1, 1]], # 98
   [-1, 1, Conv, [256, 3, 1]], # 99
   [-1, 1, Conv, [256, 3, 1]], # 100
   [-1, 1, Conv, [256, 3, 1]], # 101
   [-1, 1, Conv, [256, 3, 1]], # 102
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]], # 103
   [-1, 1, Conv, [512, 1, 1]], # 104

   [77, 1, RepConv, [256, 3, 1]], # 105
   [91, 1, RepConv, [512, 3, 1]], # 106
   [104, 1, RepConv, [1024, 3, 1]], # 107

   [[105, 106, 107], 1, IDetect, [nc, anchors]] # Detect(P3, P4, P5)
  ]


